{
  "schemaVersion": 1,
  "skills": [

    {
      "id": "Herbalism",
      "name": "Herbalism",
      "img": "modules/coffee-pub-artificer/images/skills/skill-herbalism-01.webp",
      "description": "<p><strong>Herbalism</strong> is the study and practical mastery of natural growths and botanical materials. It governs the identification, acquisition, and preparation of plants, fungi, and other naturally occurring organic substances used in crafting.</p><p>It encompasses three primary areas:</p><ul><li><strong>Identification:</strong> Recognizing natural growths and understanding their properties; distinguishing useful, edible, medicinal, toxic, or reactive specimens; identifying which parts hold potency; assessing freshness and quality; and spotting contamination, infestation, or natural mutation.</li><li><strong>Gathering &amp; Cultivation:</strong> Knowing where, when, and how to safely acquire botanical materials; harvesting without diminishing potency; extracting delicate materials such as sap, pollen, spores, or resin; preserving materials during transport; and cultivating or propagating useful plants.</li><li><strong>Botanical Preparation:</strong> Transforming raw materials into usable forms through cleaning, trimming, drying, curing, and grinding; preparing teas, poultices, salves, oils, and basic infusions; reducing natural toxicity or stabilizing volatile properties; and readying botanical ingredients for broader crafting processes.</li></ul><p>Herbalism focuses on natural materials and their direct preparation. It does not cover mineral refinement, advanced alchemical synthesis, or arcane essence manipulation.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Herbalism Kit",
      "perks": [
        {
          "perkID": "herbalism-field-forager",
          "index": 1,
          "value": 0,
          "name": "Field Forager",
          "description": "<p><strong>About the Perk</strong><br>You understand how to read the land. You know where plants prefer to grow, when they are at peak potency, and how to harvest without spoiling their strength. You are no longer guessing, you are gathering with intent.</p><p><strong>Benefits</strong></p><ul><li>You may make Herbalism gathering checks.</li><li>You can learn and craft common herbal recipes levels 0-1.</li><li>You gain access to basic ingredient tables.</li><li>You can harvest common materials without diminishing potency due to inexperience.</li></ul>",
          "requirement": "Herbalism Kit",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-leaf"
        },
        {
          "perkID": "herbalism-wildharvester",
          "index": 2,
          "value": 0,
          "name": "Wildharvester",
          "description": "<p><strong>About the Perk</strong><br>You have moved beyond simple collection. You recognize microclimates, subtle soil changes, and hidden growth patterns. Where others see forest, you see opportunity.</p><p><strong>Benefits</strong></p><ul><li>Requires <strong>Field Forager</strong>.</li><li>+2 bonus to Herbalism gathering rolls.</li><li>When you successfully harvest, you also gain <strong>1 Herb Bundle</strong>.</li><li>You may identify uncommon botanical specimens on sight (at the GM's discretion).</li><li>You reduce the impact of environmental penalties on gathering checks.</li></ul>",
          "requirement": "Field Forager",
          "cost": 3,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-seedling"
        },
        {
          "perkID": "herbalism-verdant-master",
          "index": 3,
          "value": 0,
          "name": "Verdant Master",
          "description": "<p><strong>About the Perk</strong><br>The wild yields to you. You harvest efficiently, cleanly, and at peak potency. Your hands know exactly when to cut, when to uproot, and when to leave growth undisturbed.</p><p><strong>Benefits</strong></p><ul><li>Requires <strong>Wildharvester</strong>.</li><li>+4 bonus to Herbalism gathering rolls.</li><li><strong>Double yield</strong> on successful harvests.</li><li>You may attempt to harvest rare botanicals (if the location supports them).</li><li>You never damage a harvested plant due to inexperience.</li></ul>",
          "requirement": "Wildharvester",
          "cost": 4,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-mushroom"
        },
        {
          "perkID": "herbalism-seasoned-pathfinder",
          "index": 4,
          "value": 0,
          "name": "Seasoned Pathfinder",
          "description": "<p><strong>About the Perk</strong><br>You do not wander blindly. You study soil, wind, moisture, and seasonal shifts. Where others see wilderness, you see patterns of growth and hidden opportunity.</p><p><strong>Benefits</strong></p><ul><li>Once per foraging session, you may roll twice on the rarity table and choose the result.</li><li>You may treat a biome as one rarity tier higher when determining available herbs.</li><li>“No result” outcomes are reduced by one step.</li><li>You may declare a specific herb category you are seeking (GM determines feasibility).</li></ul>",
          "requirement": "",
          "cost": 2,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-paw"
        },
        {
          "perkID": "herbalism-gentle-hand-of-the-grove",
          "index": 5,
          "value": 0,
          "name": "Gentle Hand of the Grove",
          "description": "<p><strong>About the Perk</strong><br>Your harvesting is precise and deliberate. You preserve root systems, protect potency, and avoid wasting what the land provides.</p><p><strong>Benefits</strong></p><ul><li>On a failed gathering check, you gain half yield (minimum 1 bundle).</li><li>Harvested materials never lose potency due to poor extraction.</li><li>Environmental penalties to gathering are reduced by 2.</li><li>You may safely harvest delicate materials such as sap, pollen, resin, or spores.</li></ul>",
          "requirement": "",
          "cost": 2,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-wheat"
        },
        {
          "perkID": "herbalism-green-archive-initiate",
          "index": 6,
          "value": 0,
          "name": "Initiate of the Green Archive",
          "description": "<p><strong>About the Perk</strong><br>You have studied beyond folk remedies. You understand preparation theory, preservation methods, and the deeper lessons hidden within traditional botanical texts.</p><p><strong>Benefits</strong></p><ul><li>Access to recipes <strong>0-7</strong>.</li><li>These include uncommon, intermediate herbal preparations.</li><li>Improved reliability when crafting recipes levels 2-7 (reduced failure risk, at the GMs discretion).</li><li>You can recognize when a recipe requires fresher materials or more careful preparation.</li></ul>",
          "requirement": "Field Forager",
          "cost": 2,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-book-open"
        },
        {
          "perkID": "herbalism-keeper-hidden-remedies",
          "index": 7,
          "value": 0,
          "name": "Keeper of Hidden Remedies",
          "description": "<p><strong>About the Perk</strong><br>You now study the dangerous and the misunderstood. You understand why certain plants are avoided, and how to safely coax power from them.</p><p><strong>Benefits</strong></p><ul><li>Requires <strong>Initiate of the Green Archive</strong>.</li><li>Access to recipes <strong>8-14</strong>.</li><li>These include advanced recipes and the rare lessons they have to teach.</li><li>Improved efficiency and stability when crafting recipes levels 8-14.</li></ul>",
          "requirement": "Initiate of the Green Archive",
          "cost": 2,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "mortar-pestle"
        },
        {
          "perkID": "herbalism-archdruid-verdant-codex",
          "index": 8,
          "value": 0,
          "name": "Archdruid of the Verdant Codex",
          "description": "<p><strong>About the Perk</strong><br>You no longer follow recipes. You interpret them. You understand the philosophy of growth, decay, and potency. Your preparations approach masterwork quality.</p><p><strong>Benefits</strong></p><ul><li>Requires <strong>Keeper of Hidden Remedies</strong>.</li><li>Access to recipes <strong>15-20</strong>.</li><li>These include the very rare side of herbalism and masterwork recipes.</li><li>Reduced catastrophic failure risk when crafting high-tier herbal recipes (at the GM's discretion).</li><li>Unlocks masterwork enhancements where applicable.</li></ul>",
          "requirement": "Keeper of Hidden Remedies",
          "cost": 2,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-bowl-rice"
        },

        {
          "perkID": "herbalism-experimental-botanist",
          "index": 9,
          "value": 0,
          "name": "Experimental Botanist",
          "description": "<p><strong>About the Perk</strong><br>You do not wait for perfect instruction. You test, infuse, adjust, and document. Some of your discoveries are breakthroughs. Others are cautionary tales.</p><p><strong>Benefits</strong></p><ul><li>You may attempt to craft any herbal recipe, even if you have not unlocked its tier access.</li><li>When you do, the recipe includes <strong>one hidden incorrect ingredient</strong> chosen by the GM. You do not know which ingredient is incorrect.</li><li>Crafting DC increases by <strong>+3</strong> for that attempt.</li><li>On success, the item functions normally.</li><li>On failure, the result may be unstable, partially functional, or produce a minor side effect (GM discretion).</li><li>On a critical success, you may treat that specific recipe as learned for future crafting (GM discretion).</li></ul>",
          "requirement": "",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-cauldron"
        },
        {
          "perkID": "herbalism-conservator-green-codex",
          "index": 10,
          "value": 0,
          "name": "Conservator of the Green Codex",
          "description": "<p><strong>About the Perk</strong><br>Your notes are meticulous and your process is measured. You preserve knowledge, reduce waste, and refine preparation until it is repeatable under real conditions.</p><p><strong>Benefits</strong></p><ul><li>When a crafting attempt fails, you lose only <strong>half</strong> the listed ingredients (round up), instead of all of them.</li><li>When crafting recipes within your unlocked tier access, reduce the crafting DC by <strong>1</strong>.</li><li>Once per crafting session, you may salvage <strong>one</strong> ingredient from a failed attempt that would otherwise be lost.</li><li>When crafting within your unlocked tier access, you may substitute one required ingredient with a similar ingredient of <strong>one quality tier lower</strong> (GM discretion).</li></ul>",
          "requirement": "",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-leafy-green"
        }


      ]
    },




    {
      "id": "Alchemy",
      "name": "Alchemy",
      "img": "modules/coffee-pub-artificer/images/skills/skill-alchemy-01.webp",
      "description": "<p><strong>Alchemy</strong> is the disciplined art of transforming materials through chemical, reactive, and arcane processes. It governs refinement, distillation, synthesis, and controlled reaction. Alchemy is concerned not with gathering ingredients, but with what happens when materials are combined, altered, or destabilized.</p><p>It encompasses three primary areas:</p><ul><li><strong>Reaction &amp; Synthesis:</strong> Combining components to produce new substances; managing heat, pressure, and catalysts; preventing runaway reactions; controlling volatility and instability; and balancing opposing properties. Alchemy governs the moment materials cease being themselves and become something new.</li><li><strong>Refinement &amp; Distillation:</strong> Extracting, concentrating, or purifying material properties; distilling essences from raw inputs; separating impurities; enhancing potency; stabilizing unstable compounds; and converting crude materials into refined reagents.</li><li><strong>Volatility &amp; Control:</strong> Managing dangerous or unstable processes; preventing explosions or toxic releases; neutralizing hazardous byproducts; safely containing magical or chemical reactions; and recovering partial failures.</li></ul><p>Alchemy governs potions, refined poisons, reactive compounds, stabilized essences, and advanced synthesis. It does not cover natural gathering, botanical identification, or basic field preparation of materials.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Alchemist's Supplies",
      "perks": [
        {
          "perkID": "alchemy-basic-alchemy",
          "index": 1,
          "value": 0,
          "name": "Basic Alchemy",
          "description": "You have the <strong>Alchemist's Supplies</strong> and the desire to brew potions. Nothing can stop you now. You can learn and craft common herbal recipes levels 0-1.",
          "requirement": "Alchemist's Supplies",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-vial"
        },
        {
          "perkID": "alchemy-advanced-alchemy",
          "index": 1,
          "value": 0,
          "name": "Advanced Alchemy",
          "description": "You have a firm grasp on alchemy. You can learn and craft common herbal recipes levels 2-7.",
          "requirement": "Basic Alchemy",
          "cost": 3,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-flask"
        },
        {
          "perkID": "alchemy-expert-alchemy",
          "index": 1,
          "value": 0,
          "name": "Expert Alchemy",
          "description": "You have a firm grasp on alchemy. You can learn and craft common herbal recipes levels 8-14.",
          "requirement": "Advanced Alchemy",
          "cost": 3,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-flask-vial"
        },
        {
          "perkID": "alchemy-expert-alchemy",
          "index": 1,
          "value": 0,
          "name": "Alchemy Mystic",
          "description": "You have a firm grasp on alchemy. You can learn and craft common herbal recipes levels 14-20.",
          "requirement": "Expert Alchemy",
          "cost": 4,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-flask-round-potion"
        }
      ]
    },


    {
      "id": "Poisoncraft",
      "name": "Poisoncraft",
      "img": "modules/coffee-pub-artificer/images/skills/skill-poisoncraft-01.webp",
      "description": "<p><strong>Poisoncraft</strong> is the specialized discipline of creating, refining, and deploying toxic substances for harm or incapacitation. It governs the extraction, concentration, stabilization, and application of poisons and venoms. Where Alchemy transforms materials broadly, Poisoncraft focuses on lethality, precision, and controlled delivery.</p><p>It encompasses three primary areas:</p><ul><li><strong>Extraction &amp; Concentration:</strong> Isolating venom from creature parts; extracting toxic compounds from plants and fungi; concentrating mild irritants into dangerous agents; and preserving potency during storage and transport.</li><li><strong>Refinement &amp; Stabilization:</strong> Enhancing toxicity; adjusting onset time and duration; reducing detectable color, scent, or taste; preventing accidental degradation; and minimizing risk of self-exposure.</li><li><strong>Delivery &amp; Application:</strong> Coating weapons; preparing contact, ingested, or inhaled toxins; introducing poisons into food or drink; designing delayed or conditional activation; and safely handling volatile agents.</li></ul><p>Poisoncraft governs weaponized toxins, applied venoms, and controlled delivery systems. It does not cover general botanical gathering, broad chemical synthesis, or restorative preparations.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Poisoner's Kit",
      "perks": [
        {
          "perkID": "poisoncraft-basic-poisons",
          "index": 1,
          "value": 0,
          "name": "Basic Poisons",
          "description": "You have the <strong>Poisoner's Kit</strong>  and the desire to craft poisons. Nothing can stop you now.",
          "requirement": "Poisoner's Kit",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-skull"
        }
      ]
    },


    {
      "id": "Cooking",
      "name": "Cooking",
      "img": "modules/coffee-pub-artificer/images/skills/skill-cooking-01.webp",
      "description": "<p><strong>Cooking</strong> is the practical craft of preparing food and drink that is nourishing, safe, and enjoyable. It governs selecting ingredients, applying heat and technique, preserving food, and combining flavors to produce meals, rations, and specialty dishes.</p><p>It encompasses three primary areas:</p><ul><li><strong>Preparation &amp; Technique:</strong> Cleaning, trimming, grinding, mixing, and portioning ingredients; using knives and basic tools safely; and applying methods such as roasting, boiling, frying, baking, fermenting, smoking, and drying.</li><li><strong>Flavor &amp; Quality:</strong> Balancing taste and texture; managing doneness; adjusting seasoning; and recognizing when ingredients are fresh, spoiled, or contaminated.</li><li><strong>Preservation &amp; Provisioning:</strong> Producing travel-ready rations; preserving food through salting, curing, pickling, drying, and storage; and planning meals with limited supplies and field conditions.</li></ul><p>Cooking supports the creation of food-based items, rations, and restorative meals. It focuses on nutrition, safety, and quality rather than alchemical transformation or weaponized toxins.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Cook's Utensils",
      "perks": [
        {
          "perkID": "cooking-basic-cooking",
          "index": 1,
          "value": 0,
          "name": "Basic Cooking",
          "description": "You have the <strong>Cook's Utensils</strong> and the desire to cook. Nothing can stop you now.",
          "requirement": "Cook's Utensils",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-bowl-food"
        }
      ]
    },

    {
      "id": "Healing",
      "name": "Healing",
      "img": "modules/coffee-pub-artificer/images/skills/skill-healing-01.webp",
      "description": "<p><strong>Healing</strong> is the disciplined craft of stabilizing the wounded, restoring vitality, and treating injury and illness through practical medical knowledge. It governs the use of bandages, poultices, tonics, salves, and field techniques to preserve life and support recovery.</p><p>It encompasses three primary areas:</p><ul><li><strong>Assessment &amp; Stabilization:</strong> Identifying wounds and conditions; stopping bleeding; setting fractures; cleaning injuries; preventing infection; and stabilizing a creature at the brink of death.</li><li><strong>Restoration &amp; Treatment:</strong> Applying poultices, salves, herbal remedies, and restorative draughts; treating poison exposure and disease symptoms; and accelerating natural recovery through proper care.</li><li><strong>Field Medicine &amp; Recovery:</strong> Managing limited supplies; tending multiple patients under pressure; preparing travel-ready medical kits; and overseeing rest and convalescence in harsh environments.</li></ul><p>Healing supports the creation and use of restorative items, medical supplies, and recovery-focused consumables. It emphasizes preservation of life and physical recovery rather than alchemical experimentation or magical spellcasting.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Healer's Kit",
      "perks": [
        {
          "perkID": "healing-basic-care",
          "index": 1,
          "value": 0,
          "name": "Basic Care",
          "description": "You possess a <strong>Healer's Kit</strong> and the knowledge to use it properly. You can stabilize wounds, clean injuries, and provide competent field treatment.",
          "requirement": "Healer's Kit",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-kit-medical"
        }
      ]
    },

    {
      "id": "Smithing",
      "name": "Smithing",
      "img": "modules/coffee-pub-artificer/images/skills/skill-smithing-01.webp",
      "description": "<p><strong>Smithing</strong> is the craft of shaping, forging, and refining metal into functional forms. It governs heating, hammering, tempering, joining, and finishing metal components for tools, hardware, and structural use.</p><p>It encompasses three primary areas:</p><ul><li><strong>Metal Preparation:</strong> Assessing raw metal; removing impurities; managing heat; and preparing material for shaping without compromising integrity.</li><li><strong>Forging &amp; Forming:</strong> Hammering, bending, drawing, riveting, and welding metal into precise shapes; creating balanced and durable components; and maintaining structural strength during shaping.</li><li><strong>Tempering &amp; Finish:</strong> Hardening and tempering metal for resilience; refining edges and surfaces; reinforcing stress points; and applying protective finishes.</li></ul><p>Smithing supports the creation of metal fittings, structural components, tools, hardware, and forged elements used in broader crafting. It focuses on material strength and precision shaping rather than enchantment or alchemical transformation.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Smith's Tools",
      "perks": [
        {
          "perkID": "smithing-basic-smithing",
          "index": 1,
          "value": 0,
          "name": "Basic Smithing",
          "description": "You have <strong>Smith's Tools</strong> and the foundational knowledge to heat, shape, and temper metal safely. You can produce reliable metal components, fittings, and basic forged items suitable for practical use.",
          "requirement": "Smith's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-hammer"
        }
      ]
    },


    {
      "id": "Leatherworking",
      "name": "Leatherworking",
      "img": "modules/coffee-pub-artificer/images/skills/skill-leatherworking-01.webp",
      "description": "<p><strong>Leatherworking</strong> is the craft of transforming hides, pelts, and treated skins into durable, flexible materials and finished goods. It governs curing, cutting, stitching, shaping, and reinforcing leather for practical use in equipment, clothing, and crafted components.</p><p>It encompasses three primary areas:</p><ul><li><strong>Curing &amp; Treatment:</strong> Cleaning raw hides; tanning and preserving material; preventing rot and brittleness; and preparing leather for long-term durability.</li><li><strong>Cutting &amp; Construction:</strong> Measuring, trimming, stitching, riveting, and layering leather into functional forms such as straps, sheaths, pouches, and fitted pieces.</li><li><strong>Reinforcement &amp; Finish:</strong> Strengthening stress points; adding linings or structural supports; sealing against moisture; and finishing surfaces for protection or aesthetic appeal.</li></ul><p>Leatherworking supports the creation of gear, bindings, cases, flexible armor components, and fitted coverings. It focuses on structural integrity and material performance rather than metal forging or textile weaving.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Leatherworker's Tools",
      "perks": [
        {
          "perkID": "leatherworking-basic-leatherworking",
          "index": 1,
          "value": 0,
          "name": "Basic Leatherworking",
          "description": "You have <strong>Leatherworker's Tools</strong> and the foundational knowledge to cure hides, cut clean patterns, and stitch durable leather goods. You can produce functional straps, sheaths, pouches, and fitted components suitable for everyday use.",
          "requirement": "Leatherworker's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-scissors"
        }
      ]
    },


    {
      "id": "Tinkering",
      "name": "Tinkering",
      "img": "modules/coffee-pub-artificer/images/skills/skill-tinkering-01.webp",
      "description": "<p><strong>Tinkering</strong> is the craft of designing, assembling, and repairing small mechanical devices and precision components. It governs gears, springs, housings, simple mechanisms, and the careful integration of moving parts into reliable constructs.</p><p>It encompasses three primary areas:</p><ul><li><strong>Mechanical Assembly:</strong> Constructing and aligning gears, levers, pins, and springs; ensuring balanced motion; and minimizing friction and wear.</li><li><strong>Repair &amp; Adjustment:</strong> Diagnosing mechanical faults; restoring damaged components; recalibrating misaligned parts; and improving reliability through fine adjustment.</li><li><strong>Integration &amp; Innovation:</strong> Combining mechanical elements with crafted materials; building compact mechanisms; and designing functional devices within practical size constraints.</li></ul><p>Tinkering supports the creation of tools, small devices, precision mechanisms, and integrated components used in broader crafting systems. It focuses on mechanical reliability and functional design rather than large-scale construction or magical binding.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Tinker's Tools",
      "perks": [
        {
          "perkID": "tinkering-basic-tinkering",
          "index": 1,
          "value": 0,
          "name": "Basic Tinkering",
          "description": "You have <strong>Tinker's Tools</strong> and the foundational understanding to assemble, repair, and adjust small mechanical devices. You can produce simple mechanisms and maintain precision components with dependable accuracy.",
          "requirement": "Tinker's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-gears"
        }
      ]
    },


    {
      "id": "Cartography",
      "name": "Cartography",
      "img": "modules/coffee-pub-artificer/images/skills/skill-cartography-01.webp",
      "description": "<p><strong>Cartography</strong> is the craft of measuring, recording, and communicating places through maps. It governs navigation-ready layouts, terrain interpretation, distance estimation, and the practical translation of a real location into something others can trust.</p><p>It encompasses three primary areas:</p><ul><li><strong>Survey &amp; Observation:</strong> Reading terrain, landmarks, and routes; estimating scale and distance; and capturing accurate notes under field conditions.</li><li><strong>Drafting &amp; Representation:</strong> Building clear map structure with symbols, labels, legends, and consistent scale; producing usable diagrams for travel, exploration, and planning.</li><li><strong>Navigation &amp; Reliability:</strong> Correcting maps over time, cross-checking sources, and spotting errors or misleading information before it gets someone lost.</li></ul><p>Cartography supports the creation of maps, charts, route guides, and location records. It focuses on clarity and accuracy rather than artistic illustration.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Cartographer's Tools",
      "perks": [
        {
          "perkID": "cartography-basic-cartography",
          "index": 1,
          "value": 0,
          "name": "Basic Cartography",
          "description": "You have <strong>Cartographer's Tools</strong> and the instincts to turn travel into something legible. You can sketch reliable maps, mark routes, and capture landmarks with a consistent scale and clear legend.",
          "requirement": "Cartographer's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-map"
        }
      ]
    },



    {
      "id": "Inscription",
      "name": "Inscription",
      "img": "modules/coffee-pub-artificer/images/skills/skill-inscription-01.webp",
      "description": "<p><strong>Inscription</strong> is the disciplined craft of marking language, symbols, and structured meaning onto physical surfaces. It governs precise writing, rune carving, sigil placement, and the durable recording of knowledge for practical or arcane use.</p><p>It encompasses three primary areas:</p><ul><li><strong>Script &amp; Precision:</strong> Producing clean, legible text across materials such as parchment, wood, metal, and stone; maintaining alignment, spacing, and clarity under controlled or field conditions.</li><li><strong>Symbol &amp; Rune Craft:</strong> Accurately reproducing sigils, seals, glyphs, and structured markings that must retain exact form to function as intended.</li><li><strong>Material Application:</strong> Selecting appropriate tools, inks, etching methods, or carving techniques to ensure markings endure without distortion or degradation.</li></ul><p>Inscription supports the creation of scrolls, engraved plates, runic objects, and structured written records. It focuses on accuracy, durability, and symbolic integrity rather than artistic illustration or magical synthesis.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Calligrapher's Supplies",
      "perks": [
        {
          "perkID": "inscription-basic-inscription",
          "index": 1,
          "value": 0,
          "name": "Basic Inscription",
          "description": "You possess <strong>Calligrapher's Supplies</strong> and the steady hand required to record language and symbols with clarity. You can produce clean script, consistent markings, and durable written records suitable for study, labeling, or formal documentation.",
          "requirement": "Calligrapher's Supplies",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-feather-pointed"
        }
      ]
    },


    {
      "id": "Enchanting",
      "name": "Enchanting",
      "img": "modules/coffee-pub-artificer/images/skills/skill-enchanting-01.webp",
      "description": "<p><strong>Enchanting</strong> is the structured craft of binding magical properties to objects through deliberate ritual, symbolic alignment, and controlled infusion. It governs the attachment, stabilization, and refinement of arcane effects within physical forms.</p><p>It encompasses three primary areas:</p><ul><li><strong>Arcane Imbuement:</strong> Channeling magical energy into prepared objects; anchoring effects to physical forms; and ensuring compatibility between material and intended enchantment.</li><li><strong>Stabilization &amp; Control:</strong> Preventing magical backlash, energy bleed, or structural failure; reinforcing bindings; and managing volatility during infusion.</li><li><strong>Runic &amp; Symbolic Structure:</strong> Aligning glyphs, sigils, and symbolic frameworks that allow magical effects to persist in a controlled and repeatable manner.</li></ul><p>Enchanting supports the creation and enhancement of magical items, infused tools, and stabilized arcane constructs. It focuses on controlled magical binding rather than raw spellcasting or alchemical reaction.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Enchanter's Tools",
      "perks": [
        {
          "perkID": "enchanting-basic-enchanting",
          "index": 1,
          "value": 0,
          "name": "Basic Enchanting",
          "description": "You have access to <strong>Enchanter's Tools</strong> and the foundational knowledge to bind minor magical properties to prepared objects. You can safely perform basic infusions and stabilize simple enchantments.",
          "requirement": "Enchanter's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-wand-magic-sparkles"
        }
      ]
    },


    {
      "id": "Gemcraft",
      "name": "Gemcraft",
      "img": "modules/coffee-pub-artificer/images/skills/skill-gemcraft-01.webp",
      "description": "<p><strong>Gemcraft</strong> is the disciplined craft of cutting, shaping, and setting gemstones for structural, aesthetic, and arcane purposes. It governs precision cutting, flaw assessment, polishing, and the preparation of gems for use in crafting, enchantment, or trade.</p><p>It encompasses three primary areas:</p><ul><li><strong>Assessment &amp; Grading:</strong> Identifying gem types; recognizing flaws, fractures, and inclusions; determining quality and value; and judging suitability for structural or arcane use.</li><li><strong>Cutting &amp; Shaping:</strong> Splitting, faceting, grinding, and polishing stones to maximize clarity, strength, and energy alignment.</li><li><strong>Setting &amp; Stabilization:</strong> Mounting gems securely into metal, wood, or other materials; ensuring structural integrity; and preparing stones for magical infusion or mechanical integration.</li></ul><p>Gemcraft supports the refinement of gemstones for jewelry, embedded components, arcane focuses, and precision fittings. It focuses on structural precision and material integrity rather than magical binding or mineral extraction.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Jeweler's Tools",
      "perks": [
        {
          "perkID": "gemcraft-basic-gemcraft",
          "index": 1,
          "value": 0,
          "name": "Basic Gemcraft",
          "description": "You have <strong>Jeweler's Tools</strong> and the steady precision required to cut, polish, and set gemstones. You can assess quality, shape stones safely, and prepare gems for mounting or crafting.",
          "requirement": "Jeweler's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-gem"
        }
      ]
    },


    {
      "id": "Tailoring",
      "name": "Tailoring",
      "img": "modules/coffee-pub-artificer/images/skills/skill-tailoring-01.webp",
      "description": "<p><strong>Tailoring</strong> is the craft of cutting, shaping, and assembling textiles into functional and fitted garments. It governs pattern drafting, stitching, reinforcement, and the transformation of cloth and soft materials into durable clothing and fabric components.</p><p>It encompasses three primary areas:</p><ul><li><strong>Pattern &amp; Measurement:</strong> Drafting accurate patterns; measuring for proper fit; planning seams, folds, and structure; and minimizing material waste.</li><li><strong>Construction &amp; Stitching:</strong> Cutting fabric cleanly; hand-sewing or machine stitching; reinforcing stress points; and assembling layered or lined garments.</li><li><strong>Finish &amp; Reinforcement:</strong> Hemming, sealing seams, adding closures or fastenings, and ensuring garments maintain shape and durability under regular use.</li></ul><p>Tailoring supports the creation of clothing, padded armor layers, fabric linings, banners, and flexible textile components. It focuses on fit, structure, and material integrity rather than leather curing or metal fabrication.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Weaver's Tools",
      "perks": [
        {
          "perkID": "tailoring-basic-tailoring",
          "index": 1,
          "value": 0,
          "name": "Basic Tailoring",
          "description": "You have <strong>Weaver's Tools</strong> and the foundational skill to measure, cut, and stitch textiles into reliable garments and fabric components. You can produce fitted clothing, simple padded layers, and reinforced cloth items suitable for everyday use.",
          "requirement": "Weaver's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-scissors"
        }
      ]
    },


    {
      "id": "Masonry",
      "name": "Masonry",
      "img": "modules/coffee-pub-artificer/images/skills/skill-masonry-01.webp",
      "description": "<p><strong>Masonry</strong> is the craft of shaping, fitting, and assembling stone for structural and decorative purposes. It governs quarrying, cutting, carving, and joining stone to produce durable constructions and precise stone components.</p><p>It encompasses three primary areas:</p><ul><li><strong>Stone Selection &amp; Assessment:</strong> Identifying suitable stone types; recognizing fractures and weaknesses; judging structural integrity; and selecting material appropriate to load, environment, and purpose.</li><li><strong>Cutting &amp; Shaping:</strong> Splitting, chiseling, smoothing, and carving stone to precise dimensions; creating interlocking forms; and producing fitted blocks, panels, and structural elements.</li><li><strong>Assembly &amp; Reinforcement:</strong> Laying stone with proper alignment and support; applying mortar or dry-fit techniques; reinforcing stress points; and ensuring long-term stability.</li></ul><p>Masonry supports the construction of walls, foundations, statues, structural components, and fitted stonework. It focuses on durability, precision, and load-bearing integrity rather than mineral extraction or metal forging.</p>",
      "skillEnabled": true,
      "skillPanelColor": "rgba(0, 0, 0, 0.2)",
      "skillBadgeColor": "rgba(0, 0, 0, 0.2)",
      "skillKit": "Mason's Tools",
      "perks": [
        {
          "perkID": "masonry-basic-masonry",
          "index": 1,
          "value": 0,
          "name": "Basic Masonry",
          "description": "You have <strong>Mason's Tools</strong> and the foundational knowledge to cut, shape, and set stone with reliable precision. You can produce fitted blocks, simple carvings, and structurally sound stonework suitable for practical construction.",
          "requirement": "Mason's Tools",
          "cost": 1,
          "perkLearnedBackgroundColor": "rgba(105, 139, 1, 0.5)",
          "icon": "fa-hammer"
        }
      ]
    }



  ]
}
